---
kind: type
id: T:Autodesk.Revit.DB.ImageTypeSource
source: html/b175940c-15a0-7bda-6f76-408f37e41ffe.htm
---
# Autodesk.Revit.DB.ImageTypeSource

The source of the data used to generate the image.

## Syntax (C#)
```csharp
public enum ImageTypeSource
```